GopalSaraf/Practicals/PSDL/include/proc/pic18f8628.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_PSP0_POSN                          equ 0000h
PORTD_PSP0_POSITION                      equ 0000h
PORTD_PSP0_SIZE                          equ 0001h
PORTD_PSP0_LENGTH                        equ 0001h
PORTD_PSP0_MASK                          equ 0001h
PORTD_PSP1_POSN                          equ 0001h
PORTD_PSP1_POSITION                      equ 0001h
PORTD_PSP1_SIZE                          equ 0001h
PORTD_PSP1_LENGTH                        equ 0001h
PORTD_PSP1_MASK                          equ 0002h
PORTD_PSP2_POSN                          equ 0002h
PORTD_PSP2_POSITION                      equ 0002h
PORTD_PSP2_SIZE                          equ 0001h
PORTD_PSP2_LENGTH                        equ 0001h
PORTD_PSP2_MASK                          equ 0004h
PORTD_PSP3_POSN                          equ 0003h
PORTD_PSP3_POSITION                      equ 0003h
PORTD_PSP3_SIZE                          equ 0001h
PORTD_PSP3_LENGTH                        equ 0001h
PORTD_PSP3_MASK                          equ 0008h
PORTD_PSP4_POSN                          equ 0004h
PORTD_PSP4_POSITION                      equ 0004h
PORTD_PSP4_SIZE                          equ 0001h
PORTD_PSP4_LENGTH                        equ 0001h
PORTD_PSP4_MASK                          equ 0010h
PORTD_PSP5_POSN                          equ 0005h
PORTD_PSP5_POSITION                      equ 0005h
PORTD_PSP5_SIZE                          equ 0001h
PORTD_PSP5_LENGTH                        equ 0001h
PORTD_PSP5_MASK                          equ 0020h
PORTD_PSP6_POSN                          equ 0006h
PORTD_PSP6_POSITION                      equ 0006h
PORTD_PSP6_SIZE                          equ 0001h
PORTD_PSP6_LENGTH                        equ 0001h
PORTD_PSP6_MASK                          equ 0040h
PORTD_PSP7_POSN                          equ 0007h
PORTD_PSP7_POSITION                      equ 0007h
PORTD_PSP7_SIZE                          equ 0001h
PORTD_PSP7_LENGTH                        equ 0001h
PORTD_PSP7_MASK                          equ 0080h
PORTD_AD0_POSN                           equ 0000h
PORTD_AD0_POSITION                       equ 0000h
PORTD_AD0_SIZE                           equ 0001h
PORTD_AD0_LENGTH                         equ 0001h
PORTD_AD0_MASK                           equ 0001h
PORTD_AD1_POSN                           equ 0001h
PORTD_AD1_POSITION                       equ 0001h
PORTD_AD1_SIZE                           equ 0001h
PORTD_AD1_LENGTH                         equ 0001h
PORTD_AD1_MASK                           equ 0002h
PORTD_AD2_POSN                           equ 0002h
PORTD_AD2_POSITION                       equ 0002h
PORTD_AD2_SIZE                           equ 0001h
PORTD_AD2_LENGTH                         equ 0001h
PORTD_AD2_MASK                           equ 0004h
PORTD_AD3_POSN                           equ 0003h
PORTD_AD3_POSITION                       equ 0003h
PORTD_AD3_SIZE                           equ 0001h
PORTD_AD3_LENGTH                         equ 0001h
PORTD_AD3_MASK                           equ 0008h
PORTD_AD4_POSN                           equ 0004h
PORTD_AD4_POSITION                       equ 0004h
PORTD_AD4_SIZE                           equ 0001h
PORTD_AD4_LENGTH                         equ 0001h
PORTD_AD4_MASK                           equ 0010h
PORTD_AD5_POSN                           equ 0005h
PORTD_AD5_POSITION                       equ 0005h
PORTD_AD5_SIZE                           equ 0001h
PORTD_AD5_LENGTH                         equ 0001h
PORTD_AD5_MASK                           equ 0020h
PORTD_AD6_POSN                           equ 0006h
PORTD_AD6_POSITION                       equ 0006h
PORTD_AD6_SIZE                           equ 0001h
PORTD_AD6_LENGTH                         equ 0001h
PORTD_AD6_MASK                           equ 0040h
PORTD_AD7_POSN                           equ 0007h
PORTD_AD7_POSITION                       equ 0007h
PORTD_AD7_SIZE                           equ 0001h
PORTD_AD7_LENGTH                         equ 0001h
PORTD_AD7_MASK                           equ 0080h
PORTD_SDA2_POSN                          equ 0005h
PORTD_SDA2_POSITION                      equ 0005h
PORTD_SDA2_SIZE                          equ 0001h
PORTD_SDA2_LENGTH                        equ 0001h
PORTD_SDA2_MASK                          equ 0020h
PORTD_SCL2_POSN                          equ 0006h
PORTD_SCL2_POSITION                      equ 0006h
PORTD_SCL2_SIZE                          equ 0001h
PORTD_SCL2_LENGTH                        equ 0001h
PORTD_SCL2_MASK                          equ 0040h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h
PORTD_NOT_SS2_POSN                       equ 0007h
PORTD_NOT_SS2_POSITION                   equ 0007h
PORTD_NOT_SS2_SIZE                       equ 0001h
PORTD_NOT_SS2_LENGTH                     equ 0001h
PORTD_NOT_SS2_MASK                       equ 0080h
PORTD_SDO2_POSN                          equ 0004h
PORTD_SDO2_POSITION                      equ 0004h
PORTD_SDO2_SIZE                          equ 0001h
PORTD_SDO2_LENGTH                        equ 0001h
PORTD_SDO2_MASK                          equ 0010h
PORTD_SDI2_POSN                          equ 0005h
PORTD_SDI2_POSITION                      equ 0005h
PORTD_SDI2_SIZE                          equ 0001h
PORTD_SDI2_LENGTH                        equ 0001h
PORTD_SDI2_MASK                          equ 0020h
PORTD_SCK2_POSN                          equ 0006h
PORTD_SCK2_POSITION                      equ 0006h
PORTD_SCK2_SIZE                          equ 0001h
PORTD_SCK2_LENGTH                        equ 0001h
PORTD_SCK2_MASK                          equ 0040h
PORTD_nSS2_POSN                          equ 0007h
PORTD_nSS2_POSITION                      equ 0007h
PORTD_nSS2_SIZE                          equ 0001h
PORTD_nSS2_LENGTH                        equ 0001h
PORTD_nSS2_MASK                          equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RE4_POSN                           equ 0004h
PORTE_RE4_POSITION                       equ 0004h
PORTE_RE4_SIZE                           equ 0001h
PORTE_RE4_LENGTH                         equ 0001h
PORTE_RE4_MASK                           equ 0010h
PORTE_RE5_POSN                           equ 0005h
PORTE_RE5_POSITION                       equ 0005h
PORTE_RE5_SIZE                           equ 0001h
PORTE_RE5_LENGTH                         equ 0001h
PORTE_RE5_MASK                           equ 0020h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h
PORTE_RD_POSN                            equ 0000h
PORTE_RD_POSITION                        equ 0000h
PORTE_RD_SIZE                            equ 0001h
PORTE_RD_LENGTH                          equ 0001h
PORTE_RD_MASK                            equ 0001h
PORTE_WR_POSN                            equ 0001h
PORTE_WR_POSITION                        equ 0001h
PORTE_WR_SIZE                            equ 0001h
PORTE_WR_LENGTH                          equ 0001h
PORTE_WR_MASK                            equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_ECCP2_POSN                         equ 0007h
PORTE_ECCP2_POSITION                     equ 0007h
PORTE_ECCP2_SIZE                         equ 0001h
PORTE_ECCP2_LENGTH                       equ 0001h
PORTE_ECCP2_MASK                         equ 0080h
PORTE_NOT_RD_POSN                        equ 0000h
PORTE_NOT_RD_POSITION                    equ 0000h
PORTE_NOT_RD_SIZE                        equ 0001h
PORTE_NOT_RD_LENGTH                      equ 0001h
PORTE_NOT_RD_MASK                        equ 0001h
PORTE_NOT_WR_POSN                        equ 0001h
PORTE_NOT_WR_POSITION                    equ 0001h
PORTE_NOT_WR_SIZE                        equ 0001h
PORTE_NOT_WR_LENGTH                      equ 0001h
PORTE_NOT_WR_MASK                        equ 0002h
PORTE_NOT_CS_POSN                        equ 0002h
PORTE_NOT_CS_POSITION                    equ 0002h
PORTE_NOT_CS_SIZE                        equ 0001h
PORTE_NOT_CS_LENGTH                      equ 0001h
PORTE_NOT_CS_MASK                        equ 0004h
PORTE_nRD_POSN                           equ 0000h
PORTE_nRD_POSITION                       equ 0000h
PORTE_nRD_SIZE                           equ 0001h
PORTE_nRD_LENGTH                         equ 0001h
PORTE_nRD_MASK                           equ 0001h
PORTE_nWR_POSN                           equ 0001h
PORTE_nWR_POSITION                       equ 0001h
PORTE_nWR_SIZE                           equ 0001h
PORTE_nWR_LENGTH                         equ 0001h
PORTE_nWR_MASK                           equ 0002h
PORTE_nCS_POSN                           equ 0002h
PORTE_nCS_POSITION                       equ 0002h
PORTE_nCS_SIZE                           equ 0001h
PORTE_nCS_LENGTH                         equ 0001h
PORTE_nCS_MASK                           equ 0004h
PORTE_CCP2_POSN                          equ 0007h
PORTE_CCP2_POSITION                      equ 0007h
PORTE_CCP2_SIZE                          equ 0001h
PORTE_CCP2_LENGTH                        equ 0001h
PORTE_CCP2_MASK                          equ 0080h
PORTE_AD8_POSN                           equ 0000h
PORTE_AD8_POSITION                       equ 0000h
PORTE_AD8_SIZE                           equ 0001h
PORTE_AD8_LENGTH                         equ 0001h
PORTE_AD8_MASK                           equ 0001h
PORTE_AD9_POSN                           equ 0001h
PORTE_AD9_POSITION                       equ 0001h
PORTE_AD9_SIZE                           equ 0001h
PORTE_AD9_LENGTH                         equ 0001h
PORTE_AD9_MASK                           equ 0002h
PORTE_AD10_POSN                          equ 0002h
PORTE_AD10_POSITION                      equ 0002h
PORTE_AD10_SIZE                          equ 0001h
PORTE_AD10_LENGTH                        equ 0001h
PORTE_AD10_MASK                          equ 0004h
PORTE_AD11_POSN                          equ 0003h
PORTE_AD11_POSITION                      equ 0003h
PORTE_AD11_SIZE                          equ 0001h
PORTE_AD11_LENGTH                        equ 0001h
PORTE_AD11_MASK                          equ 0008h
PORTE_AD12_POSN                          equ 0004h
PORTE_AD12_POSITION                      equ 0004h
PORTE_AD12_SIZE                          equ 0001h
PORTE_AD12_LENGTH                        equ 0001h
PORTE_AD12_MASK                          equ 0010h
PORTE_AD13_POSN                          equ 0005h
PORTE_AD13_POSITION                      equ 0005h
PORTE_AD13_SIZE                          equ 0001h
PORTE_AD13_LENGTH                        equ 0001h
PORTE_AD13_MASK                          equ 0020h
PORTE_AD14_POSN                          equ 0006h
PORTE_AD14_POSITION                      equ 0006h
PORTE_AD14_SIZE                          equ 0001h
PORTE_AD14_LENGTH                        equ 0001h
PORTE_AD14_MASK                          equ 0040h
PORTE_AD15_POSN                          equ 0007h
PORTE_AD15_POSITION                      equ 0007h
PORTE_AD15_SIZE                          equ 0001h
PORTE_AD15_LENGTH                        equ 0001h
PORTE_AD15_MASK                          equ 0080h
PORTE_P2D_POSN                           equ 0000h
PORTE_P2D_POSITION                       equ 0000h
PORTE_P2D_SIZE                           equ 0001h
PORTE_P2D_LENGTH                         equ 0001h
PORTE_P2D_MASK                           equ 0001h
PORTE_P2C_POSN                           equ 0001h
PORTE_P2C_POSITION                       equ 0001h
PORTE_P2C_SIZE                           equ 0001h
PORTE_P2C_LENGTH                         equ 0001h
PORTE_P2C_MASK                           equ 0002h
PORTE_P2B_POSN                           equ 0002h
PORTE_P2B_POSITION                       equ 0002h
PORTE_P2B_SIZE                           equ 0001h
PORTE_P2B_LENGTH                         equ 0001h
PORTE_P2B_MASK                           equ 0004h
PORTE_P3C_POSN                           equ 0003h
PORTE_P3C_POSITION                       equ 0003h
PORTE_P3C_SIZE                           equ 0001h
PORTE_P3C_LENGTH                         equ 0001h
PORTE_P3C_MASK                           equ 0008h
PORTE_P3B_POSN                           equ 0004h
PORTE_P3B_POSITION                       equ 0004h
PORTE_P3B_SIZE                           equ 0001h
PORTE_P3B_LENGTH                         equ 0001h
PORTE_P3B_MASK                           equ 0010h
PORTE_P1C_POSN                           equ 0005h
PORTE_P1C_POSITION                       equ 0005h
PORTE_P1C_SIZE                           equ 0001h
PORTE_P1C_LENGTH                         equ 0001h
PORTE_P1C_MASK                           equ 0020h
PORTE_P1B_POSN                           equ 0006h
PORTE_P1B_POSITION                       equ 0006h
PORTE_P1B_SIZE                           equ 0001h
PORTE_P1B_LENGTH                         equ 0001h
PORTE_P1B_MASK                           equ 0040h
PORTE_P2A_POSN                           equ 0007h
PORTE_P2A_POSITION                       equ 0007h
PORTE_P2A_SIZE                           equ 0001h
PORTE_P2A_LENGTH                         equ 0001h
PORTE_P2A_MASK                           equ 0080h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_CCP8E_POSN                         equ 0004h
PORTE_CCP8E_POSITION                     equ 0004h
PORTE_CCP8E_SIZE                         equ 0001h
PORTE_CCP8E_LENGTH                       equ 0001h
PORTE_CCP8E_MASK                         equ 0010h
PORTE_CCP7E_POSN                         equ 0005h
PORTE_CCP7E_POSITION                     equ 0005h
PORTE_CCP7E_SIZE                         equ 0001h
PORTE_CCP7E_LENGTH                       equ 0001h
PORTE_CCP7E_MASK                         equ 0020h
PORTE_CCP6E_POSN                         equ 0006h
PORTE_CCP6E_POSITION                     equ 0006h
PORTE_CCP6E_SIZE                         equ 0001h
PORTE_CCP6E_LENGTH                       equ 0001h
PORTE_CCP6E_MASK                         equ 0040h
PORTE_CCP2E_POSN                         equ 0007h
PORTE_CCP2E_POSITION                     equ 0007h
PORTE_CCP2E_SIZE                         equ 0001h
PORTE_CCP2E_LENGTH                       equ 0001h
PORTE_CCP2E_MASK                         equ 0080h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h
PORTE_PB3E_POSN                          equ 0004h
PORTE_PB3E_POSITION                      equ 0004h
PORTE_PB3E_SIZE                          equ 0001h
PORTE_PB3E_LENGTH                        equ 0001h
PORTE_PB3E_MASK                          equ 0010h
PORTE_PC1E_POSN                          equ 0005h
PORTE_PC1E_POSITION                      equ 0005h
PORTE_PC1E_SIZE                          equ 0001h
PORTE_PC1E_LENGTH                        equ 0001h
PORTE_PC1E_MASK                          equ 0020h
PORTE_PB1E_POSN                          equ 0006h
PORTE_PB1E_POSITION                      equ 0006h
PORTE_PB1E_SIZE                          equ 0001h
PORTE_PB1E_LENGTH                        equ 0001h
PORTE_PB1E_MASK                          equ 0040h
PORTE_PA2E_POSN                          equ 0007h
PORTE_PA2E_POSITION                      equ 0007h
PORTE_PA2E_SIZE                          equ 0001h
PORTE_PA2E_LENGTH                        equ 0001h
PORTE_PA2E_MASK                          equ 0080h

